[
    {
        "id": 1,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/kaqugu/deliveroo_went_down_and_when_it_finally_started/",
        "header": "Deliveroo went down, and users faced hurdles in getting refunds for delayed orders.",
        "description": "The delivery time and support live chat waititng list was too long, causing significant order delays. When users tried to get refunds for delayed orders, they faced unhelpful responses and the chat system closed sessions without resolving the issue.",
        "case": "Difficult refund process.",
        "explanation": "This aligns with the 'Roach Motel' dark pattern. While it's easy to place an order, the process to exit (getting a refund) is intentionally frustrating, involving delayed responses and unresolved queries, discouraging users from pursuing refunds.",
        "type": "Roach Motel",
        "date": "unknown"
    },
    {
        "id": 2,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/y789xg/trying_to_ask_lenovo_support_if_theyre_launching/",
        "header": "Trying to ask Lenovo Support if they’re launching a new product.",
        "description": "The user attempted to ask Lenovo Support about a product launch but was required to provide personal information such as name, email, and phone number before asking their question.",
        "case": "Forcing unnecessary personal data disclosure.",
        "explanation": "This aligns with the 'Privacy Zuckering' dark pattern. The chat system pressures users into sharing personal information, such as email and phone number, before they can proceed, exploiting their need for support to collect unnecessary data.",
        "type": "Privacy Zuckering",
        "date": "October 17, 2022"
    },
    {
        "id": 3,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/wmffym/air_asia_customer_support_bot_takes_sweet_ass/",
        "header": "Air Asia customer support bot takes sweet ass time to respond to pre-selected prompts to imitate an actual person. If dealing with corporate customer support wasn't infuriating enough as is.",
        "description": "The user reported that Air Asia's support bot is unhelpful and significantly delays responses, making it difficult to resolve issues or reach a human agent.",
        "case": "Delayed and frustrating customer support.",
        "explanation": "This aligns with the 'Roach Motel' dark pattern. It is easy for users to engage with the service (make bookings), but resolving issues or exiting the service (via support) becomes intentionally frustrating due to delays and unhelpful automated responses.",
        "type": "Roach Motel",
        "date": "August 13, 2022"
    },
    {
        "id": 4,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/12x3wxz/some_customer_service_bots_dont_even_try_just/",
        "header": "some customer service bots don't even try... just give me a person ffs",
        "description": "The user reported that the customer service bot repeatedly responds with 'I don't understand,' failing to provide assistance or escalate the issue to a human agent.",
        "case": "Unhelpful bot trapping users in unresolved issues.",
        "explanation": "This aligns with the 'Roach Motel' dark pattern. Users are easily directed to use the bot for support but are then stuck in a loop of unhelpful responses, making it difficult to resolve their issues or reach a human agent.",
        "type": "Roach Motel",
        "date": "May 22, 2023"
    },
    {
        "id": 5,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/ajkmg2/you_have_to_pay_to_unlock_messages_the_price_for/",
        "header": "You have to pay to unlock messages, the price for a month is $40",
        "description": "The user was redirected to a chat and expected a response from the other person. However, when the reply came, the app prompted the user to pay for a premium subscription to unlock the message, effectively blocking access without payment.",
        "case": "Basic functionality locked behind a paywall.",
        "explanation": "This aligns with the 'Forced Continuity' dark pattern. Users are enticed into engaging with the service, but are then blocked from accessing basic functionality (reading replies) unless they pay, exploiting their expectations and engagement.",
        "type": "Forced Continuity",
        "date": "January 24, 2019"
    },
    {
        "id": 6,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/11jv71o/you_must_opt_in_for_their_promotion_messages_in/",
        "header": "You must opt in for their promotion messages to use their customer service chat.",
        "description": "The user was required to opt into receiving promotional messages in order to access customer service chat, effectively forcing them to agree to marketing communications to receive support.",
        "case": "Forced agreement to promotional messages.",
        "explanation": "This aligns with the 'Forced Consent' dark pattern. Users are compelled to accept promotional messaging as a mandatory condition to access essential services, removing their freedom to choose.",
        "type": "Forced Consent",
        "date": "March 6, 2023"
    },
    {
        "id": 7,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/7y1n05/flowkey_cancel_subscription_only_via_chat_time_to/",
        "header": "Flowkey: cancel subscription only via chat. 'Time to response: usually one day.'",
        "description": "The user found that canceling their subscription was only possible through a chat system, which had an estimated response time of 'usually one day,' creating unnecessary delays and barriers.",
        "case": "Deliberate delays in subscription cancellation.",
        "explanation": "This aligns with the 'Roach Motel' dark pattern. It’s easy to subscribe to the service, but canceling is intentionally made difficult through long response times and restricted cancellation channels, discouraging users from completing the process.",
        "type": "Roach Motel",
        "date": "February 12, 2018"
    },
    {
        "id": 8,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/1dxbqmc/xfinity_wifi_hotspot_now_pass_claims_you_can/",
        "header": "Xfinity WiFi hotspot pass claims you can connect 2 devices with one purchase but doesn’t work.",
        "description": "The user purchased an Xfinity WiFi hotspot pass, which claimed it could connect two devices. However, the feature didn’t work as advertised. When seeking support, they were directed to a phone support line with extended wait times and a live chat page that never connected to an agent.",
        "case": "Support designed to discourage issue resolution.",
        "explanation": "This aligns with the 'Roach Motel' dark pattern. Users are drawn in with an appealing offer, but when they encounter an issue, the support system creates intentional barriers—long wait times and unresponsive chat—to prevent resolution.",
        "type": "Roach Motel",
        "date": "June 7, 2024"
    },
    {
        "id": 9,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/y0aio2/keep_the_app_open_for_an_hour_to_chat_with_a/",
        "header": "Keep the app open for an hour to chat with a customer representative.",
        "description": "The user encountered a support system where they had to keep the app open for nearly an hour to maintain their position in a long customer service queue. Closing the app would result in losing their spot.",
        "case": "Unreasonable requirements for customer support.",
        "explanation": "This aligns with the 'Roach Motel' dark pattern. While accessing support seems easy, resolving the issue becomes intentionally frustrating with excessive waiting times and restrictive requirements, such as keeping the app open for an extended period.",
        "type": "Roach Motel",
        "date": "October 9, 2022"
    },
    {
        "id": 10,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/v8ze75/new_york_times_making_it_a_royal_pain_to_cancel/",
        "header": "New York Times making it a royal pain to cancel a subscription.",
        "description": "The user tried to cancel their New York Times subscription via chat support. Despite being placed in a queue and waiting for over an hour, there was no response from customer support, making the cancellation process unnecessarily difficult.",
        "case": "Intentional delays in subscription cancellation.",
        "explanation": "This aligns with the 'Roach Motel' dark pattern. It is easy to subscribe, but canceling becomes intentionally frustrating with long wait times and unresponsive chat support, discouraging users from completing the process.",
        "type": "Roach Motel",
        "date": "June 22, 2022"
    },
    {
        "id": 11,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/114qeae/cant_cancel_geico_insurance_without_chatting_with/",
        "header": "Can’t cancel Geico insurance without chatting with an agent.",
        "description": "The user attempted to cancel their Geico insurance policy but was forced to go through a chat with an agent. The process involved waiting in a queue, creating unnecessary delays and barriers to cancellation.",
        "case": "Forcing users to chat for policy cancellation.",
        "explanation": "This aligns with the 'Roach Motel' dark pattern. While signing up for the insurance is straightforward, canceling requires going through an intentionally cumbersome process, including waiting in a queue and chatting with an agent, discouraging users from completing the cancellation.",
        "type": "Roach Motel",
        "date": "February 24, 2023"
    },
    {
        "id": 12,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/c6iksy/dpd_delivery_company_chat_bot_pretends_to_be_a/",
        "header": "DPD delivery company chatbot pretends to be a human & lies about delivery info.",
        "description": "The user interacted with DPD's chatbot, which presented itself as a human agent. The bot provided misleading delivery information, and when the user tried to escalate the issue, it redirected them to an external support page instead of resolving the problem.",
        "case": "Misleading chatbot interaction.",
        "explanation": "This aligns with the 'Customer Service Avoidance' dark pattern. The chatbot pretended to assist but ultimately avoided resolving the user's issue, redirecting them to external resources instead of providing actual support.",
        "type": "Customer Service Avoidance",
        "date": "July 1, 2019"
    },
    {
        "id": 13,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/c6iksy/dpd_delivery_company_chat_bot_pretends_to_be_a/",
        "header": "DPD delivery company chatbot pretends to be a human & lies about delivery info.",
        "description": "The user interacted with DPD's chatbot, which presented itself as a human agent. The bot provided misleading delivery information, and when the user tried to escalate the issue, it redirected them to an external support page instead of resolving the problem.",
        "case": "Misleading chatbot interaction with no resolution.",
        "explanation": "This aligns with the 'Roach Motel' dark pattern. Users are drawn into using the chatbot for support, but when they encounter an issue, escaping the loop of unhelpful responses and reaching a proper resolution becomes intentionally difficult.",
        "type": "Roach Motel",
        "date": "July 1, 2019"
    },
    {
        "id": 14,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/11l1paa/rogers_telecom_pushes_you_to_use_the_online/",
        "header": "Rogers telecom pushes you to use the online chatbot but won’t place you in a live chat queue.",
        "description": "The user was directed to use an online chatbot instead of calling for support. However, when trying to reach a live chat agent, the system refused to place them in a queue, stating that all agents were busy, effectively blocking access to real support.",
        "case": "Live chat queue avoidance.",
        "explanation": "This aligns with the 'Roach Motel' dark pattern. Users are funneled into the chatbot system with the expectation of receiving support, but are then prevented from progressing to live assistance, leaving them stuck without resolution.",
        "type": "Roach Motel",
        "date": "March 6, 2023"
    },
    {
        "id": 15,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/100rb5f/sirius_xm_wont_let_you_cancel_online_unless_you/",
        "header": "Sirius XM won't let you cancel online unless you chat with a live agent or call them.",
        "description": "The user attempted to cancel their Sirius XM subscription online but was forced to either call customer support or interact with a live agent via chat. The chat process included repeated attempts to retain the customer with offers and unnecessary questioning, making the cancellation unnecessarily time-consuming.",
        "case": "Complicated and obstructive subscription cancellation.",
        "explanation": "This aligns with the 'Roach Motel' dark pattern. While subscribing is simple, the cancellation process is deliberately obstructed with forced interactions, repetitive questioning, and unnecessary offers, discouraging users from completing the process.",
        "type": "Roach Motel",
        "date": "January 1, 2023"
    },
    {
        "id": 16,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/lnda8l/before_buying_a_nyt_subscription_heres_what_itll/",
        "header": "Before buying a NYT subscription, here's what it'll take to cancel it.",
        "description": "The user attempted to cancel their New York Times subscription and was required to go through a lengthy chat process. The chatbot asked for personal details, repeated unnecessary questions, and transferred the user multiple times before reaching an account specialist, making the process unnecessarily complex and frustrating. Additionally, the user was offered discounts and incentives to delay or avoid cancellation.",
        "case": "Overly complicated and obstructive subscription cancellation process.",
        "explanation": "This aligns with both the 'Roach Motel' and 'Forced Continuity' dark patterns. 'Roach Motel' is evident because subscribing is easy, but canceling requires navigating repeated steps, excessive questioning, and unnecessary transfers. 'Forced Continuity' applies as the chatbot or representative repeatedly attempts to offer discounts and alternative plans to discourage immediate cancellation.",
        "type": ["Roach Motel, Forced Continuity"],
        "date": "February 16, 2021"
    },
    {
        "id": 17,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/nxy28x/waited_for_50_min_and_then_given_a_6_second_window/",
        "header": "Waited for 50 min and then given a 6-second window.",
        "description": "The user waited for 50 minutes in a support queue. When an agent finally responded, the user was given only a 6-second window to reply before the session was automatically closed, preventing resolution.",
        "case": "Unreasonable support chat timeout.",
        "explanation": "This aligns with the 'Roach Motel' dark pattern. While accessing support is made to appear straightforward, the system creates intentional barriers like unreasonable timeouts, making it difficult for users to resolve their issues.",
        "type": "Roach Motel",
        "date": "June 12, 2021"
    },
    {
        "id": 18,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/di5haq/adobe_does_not_let_you_cancel_your_subscription/",
        "header": "Adobe does not let you cancel your subscription online.",
        "description": "The user attempted to cancel their Adobe subscription but was forced to go through a customer support chat. The cancellation process was not immediate, and the support interaction introduced unnecessary delays.",
        "case": "Obstructed subscription cancellation process.",
        "explanation": "This aligns with the 'Roach Motel' dark pattern. While subscribing to Adobe is easy, canceling requires navigating through unnecessary barriers, including forced interactions with customer support and delayed processing.",
        "type": "Roach Motel",
        "date": "October 9, 2019"
    },
    {
        "id": 19,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/v81hsr/twitch_suddenly_forcing_users_to_give_their_phone/",
        "header": "Twitch suddenly forcing users to give their phone number in order to chat.",
        "description": "The user encountered a restriction on Twitch where participation in chat across all channels required verifying their account with a mobile phone number, without any alternative verification method available.",
        "case": "Forced phone number verification.",
        "explanation": "This aligns with the 'Forced Consent' dark pattern. Users are compelled to provide their personal phone numbers to access basic chat features, removing their ability to opt out or use alternative verification methods.",
        "type": "Forced Consent",
        "date": "June 22, 2022"
    },
    {
        "id": 20,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/k6kz8b/live_chat_that_does_not_go_away_when_closed/",
        "header": "Live chat that does not go away when closed.",
        "description": "The user encountered a live chat feature that repeatedly reopened after being closed. Each time the chat was dismissed, it would reappear with a new automated agent greeting, creating frustration and interrupting the user experience.",
        "case": "Persistent live chat pop-up.",
        "explanation": "This aligns with the 'Roach Motel' dark pattern. While interacting with live chat seems optional, users are effectively trapped in repeated prompts, as the chat cannot be fully dismissed, disrupting normal navigation.",
        "type": "Roach Motel",
        "date": "December 4, 2020"
    },
    {
        "id": 21,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/1ebrfv6/congrats_amazon_for_building_a_chatbot_that/",
        "header": "Congrats Amazon, for building a chatbot that doesn't even let people type.",
        "description": "The user interacted with Amazon's chatbot, which repeatedly asked predefined questions and failed to address their issue. Despite selecting 'Something else' multiple times, the chatbot kept redirecting them to the same options without allowing free text input.",
        "case": "Chatbot prevents free input and loops predefined options.",
        "explanation": "This aligns with the 'Roach Motel' dark pattern. While the chatbot creates the illusion of assistance, it traps users in repetitive predefined questions without allowing them to freely describe their problem, preventing meaningful resolution.",
        "type": "Roach Motel",
        "date": "June 10, 2024"
    },
    {
        "id": 22,
        "source": "reddit.com",
        "url": "https://reddit.com/r/assholedesign/comments/19bp3ja/i_wanted_to_try_free_month_of_the_economist_then/",
        "header": "Canceling The Economist subscription requires live chat and over an hour of wait time.",
        "description": "The user tried to cancel their free month subscription to avoid being charged. However, the cancellation process required them to use a live chat system. The chat involved long wait times, repetitive automated messages, and unnecessary delays, making the cancellation process tedious and time-consuming.",
        "case": "Obstructed subscription cancellation via chat.",
        "explanation": "This aligns with the 'Roach Motel' dark pattern. While subscribing to the service is simple, canceling is intentionally made difficult with prolonged waiting times, dependency on live chat, and repetitive automated responses that delay resolution.",
        "type": "Roach Motel",
        "date": "March 2, 2024"
    },
    {
        "id": 23,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/10y59rz/attempting_to_cancel_xfinity_via_chathow_expected/",
        "header": "Attempting to cancel Xfinity via chat...how expected.",
        "description": "The user attempted to cancel their Xfinity services via chat. However, the chatbot presented repetitive prompts, pushed alternative options like calling customer support, and ultimately failed to process the cancellation, creating unnecessary obstacles.",
        "case": "Obstructed cancellation via chatbot.",
        "explanation": "This aligns with the 'Roach Motel' dark pattern. While signing up for the service is easy, canceling is intentionally made difficult with repetitive chatbot loops, unhelpful options, and an ultimate failure to process the user's request efficiently.",
        "type": "Roach Motel",
        "date": "February 7, 2023"
    },
    {
        "id": 24,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/r5hmnu/good_old_spectrum_support_used_the_chat_and_got/",
        "header": "Good old Spectrum support—chat leads nowhere, and phone support is equally unhelpful.",
        "description": "The user attempted to get support via Spectrum's online chat, but the chat was unavailable, displaying 'closed' for every listed business day. When trying phone support, the user was stuck in long scripts and repetitive troubleshooting steps, with no resolution.",
        "case": "Unhelpful and unavailable customer support.",
        "explanation": "This aligns with the 'Customer Service Avoidance' dark pattern. While support options are presented, they are intentionally made unavailable or unhelpful, preventing the user from resolving their issue efficiently.",
        "type": "Customer Service Avoidance",
        "date": "December 9, 2021"
    },
    {
        "id": 25,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/180r8st/sony_requires_you_to_solve_ten_puzzles_to_chat/",
        "header": "Sony requires you to solve ten puzzles to chat with a representative.",
        "description": "The user attempted to contact Sony support for a refund but was required to solve ten puzzles before being allowed to chat with a representative. After completing all puzzles, the system failed to connect them, preventing issue resolution.",
        "case": "Unnecessary barriers to accessing support.",
        "explanation": "This aligns with the 'Roach Motel' dark pattern. While accessing the support system appears straightforward, users are trapped in repetitive and unnecessary tasks (solving puzzles) that prevent them from reaching actual support agents.",
        "type": "Roach Motel",
        "date": "January 18, 2024"
    },
    {
        "id": 26,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/15glycq/so_bing_closes_the_chat_when_you_ask_why_there_is/",
        "header": "Bing closes the chat when you ask why there is an ad in the responses.",
        "description": "The user questioned why advertisements appeared in Bing chatbot responses. Instead of addressing the concern, the chatbot abruptly ended the conversation, preventing further inquiry or resolution.",
        "case": "Chat closed abruptly after a valid complaint.",
        "explanation": "This aligns with the 'Customer Service Avoidance' dark pattern. The chatbot intentionally ended the session when faced with a difficult or critical question, avoiding accountability and preventing the user from receiving a proper response.",
        "type": "Customer Service Avoidance",
        "date": "July 30, 2023"
    },
    {
        "id": 27,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/114g4bw/new_york_times_requires_you_to_chat_with_a_care/",
        "header": "New York Times requires you to chat with a 'Care Advocate' to cancel your subscription.",
        "description": "The user attempted to cancel their New York Times subscription but was forced to chat with a 'Care Advocate.' During the chat, the representative repeatedly pushed offers, discounts, and alternative plans instead of proceeding with the cancellation, prolonging the process unnecessarily.",
        "case": "Repeated retention attempts during cancellation.",
        "explanation": "This aligns with the 'Roach Motel' and 'Forced Continuity' dark patterns. 'Roach Motel' applies because canceling the subscription is deliberately made difficult with repeated barriers. 'Forced Continuity' is evident as the representative repeatedly pushed discounts and retention offers, attempting to prevent the user from canceling.",
        "type": ["Roach Motel", "Forced Continuity"],
        "date": "February 22, 2023"
    },
    {
        "id": 28,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/1fkzyrl/this_is_the_epitome_of_asshole_design/",
        "header": "Snapchat requires a Snapchat+ subscription to remove My AI.",
        "description": "The user discovered that Snapchat now requires users to subscribe to Snapchat+ to remove 'My AI' from their chat feed. Previously, it was removable for all users, but it has been locked behind a paywall, forcing users to pay for a feature removal.",
        "case": "Feature removal locked behind a paywall.",
        "explanation": "This aligns with the 'Forced Continuity' dark pattern. Users are forced into an ongoing subscription to access basic control over their interface, such as removing an unwanted AI feature, exploiting their frustration for profit.",
        "type": "Forced Continuity",
        "date": "June 15, 2024"
    },
    {
        "id": 29,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/ul439p/uber_eats_support_intentionally_misunderstanding/",
        "header": "Uber Eats support intentionally 'misunderstanding' an issue and closing the chat.",
        "description": "The user reported an issue to Uber Eats support. Instead of addressing the concern, the support agent provided a dismissive response and immediately closed the chat when the user pointed out the lack of resolution.",
        "case": "Support chat closed without resolving the issue.",
        "explanation": "This aligns with the 'Customer Service Avoidance' dark pattern. The support agent intentionally avoided addressing the issue, provided vague responses, and abruptly closed the chat to prevent further escalation or resolution.",
        "type": "Customer Service Avoidance",
        "date": "May 8, 2022"
    },
    {
        "id": 30,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/13wjpsw/danish_postal_service_postnord_really_dont_want/",
        "header": "Danish postal service (PostNord) makes contacting support unnecessarily difficult.",
        "description": "The user reported that in order to chat with PostNord support, they were required to download the app, create an account, and remain active in the app while waiting in a long queue. The wait time exceeded an hour, and leaving the app would result in losing their place in the queue.",
        "case": "Prolonged and restricted customer support access.",
        "explanation": "This aligns with the 'Roach Motel' dark pattern. While accessing support seems available, the process is intentionally made difficult with excessive prerequisites (downloading an app, creating an account) and restrictive requirements (staying active in the app during long wait times), discouraging users from seeking assistance.",
        "type": "Roach Motel",
        "date": "May 31, 2023"
    },
    {
        "id": 31,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/15g3hkk/lyca_live_chat_claims_internet_connectivity/",
        "header": "Lyca live chat claims internet connectivity issues, disconnects me, then claims that I'm not there.",
        "description": "The user attempted to resolve an issue with Lyca Mobile through their live chat support. Despite repeated attempts to stay connected and provide the required information, the chatbot claimed connectivity issues, disconnected the user, and falsely stated that the user was unresponsive.",
        "case": "Support chat disconnects without resolution.",
        "explanation": "This aligns with the 'Customer Service Avoidance' dark pattern. The chatbot repeatedly failed to maintain a connection, falsely blamed the user for inactivity, and prematurely ended the session, preventing the issue from being resolved.",
        "type": "Customer Service Avoidance",
        "date": "August 2, 2023"
    },
    {
        "id": 32,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/wr0v7n/no_wait_time_on_chat_no_log_of_time_chatting/",
        "header": "No wait time displayed on chat, and no indication of response time.",
        "description": "The user attempted to get support via chat, but despite repeated messages and a long wait time, there was no indication of how long they would need to wait or where they stood in the queue. The chatbot kept sending repetitive automated messages without escalating or resolving the issue.",
        "case": "Lack of transparency in support queue.",
        "explanation": "This aligns with the 'Customer Service Avoidance' dark pattern. The chat system avoided providing meaningful assistance by withholding information about wait times, failing to respond with an actual agent, and relying on repetitive automated replies.",
        "type": "Customer Service Avoidance",
        "date": "August 15, 2022"
    },
    {
        "id": 33,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/assholedesign/comments/104lm42/customer_support_chat_makes_you_wait_a_long_time/",
        "header": "Customer support chat makes you wait a long time, then closes for inactivity.",
        "description": "The user engaged with customer support, where they were repeatedly asked to stay online while the issue was being 'checked.' Despite the user actively responding, the chat was eventually closed due to alleged 'inactivity,' forcing the user to start the process again.",
        "case": "Support chat closed despite user activity.",
        "explanation": "This aligns with the 'Customer Service Avoidance' dark pattern. The system intentionally prolongs the conversation, provides no meaningful updates, and then closes the chat prematurely by falsely attributing the closure to user inactivity, preventing resolution.",
        "type": "Customer Service Avoidance",
        "date": "January 10, 2023"
    },
    {
        "id": 34,
        "source": "reddit.com",
        "url": "https://www.reddit.com/r/darkpatterns/comments/ubptf2/modern_milkman_to_cancel_you_must_to_chat_to_a/",
        "header": "Modern Milkman: To cancel, you must chat with a bot that guilt-trips you.",
        "description": "The user attempted to cancel their subscription via a chatbot. Instead of processing the request directly, the bot repeatedly sent guilt-tripping messages about environmental contributions and positive impacts, delaying the cancellation process and pressuring the user emotionally.",
        "case": "Guilt-tripping during cancellation.",
        "explanation": "This aligns with the 'Confirmshaming' dark pattern. The chatbot intentionally guilt-tripped the user by emphasizing environmental benefits and social responsibilities, making the user feel guilty for wanting to cancel the service.",
        "type": "Confirmshaming",
        "date": "April 30, 2022"
    },
    {
        "id": 35,
        "source": "x.com",
        "url": "https://x.com/round/status/1402108762794594306",
        "header": "DashPass free delivery offer exploits ambiguity in promotion terms.",
        "description": "The user noticed a mismatch between the advertised DashPass offer for free delivery on orders over $15 and the app's actual requirements. The promotion lacked clarity about the subscription prerequisite, causing confusion and misleading expectations.",
        "case": "Ambiguous promotion terms.",
        "explanation": "This aligns with the 'Bait-and-Switch' dark pattern. The app advertises free delivery for orders over $15, but the condition of requiring a DashPass subscription is not immediately clear, misleading users into thinking they qualify without a subscription.",
        "type": "Bait-and-Switch",
        "date": "June 7, 2021"
    },
    {
        "id": 36,
        "source": "x.com",
        "url": "https://x.com/darkpatterns/status/1684829797615013888",
        "header": "AT&T's chatbot pretends not to understand user requests.",
        "description": "The user repeatedly requested to speak with a billing representative after being charged post-service cancellation. The chatbot deliberately avoided escalating the issue by pretending not to understand the repeated requests.",
        "case": "Chatbot deliberately avoids escalation.",
        "explanation": "This aligns with the 'Customer Service Avoidance' dark pattern. The chatbot intentionally feigned confusion and repeatedly asked for clarification, preventing the user from reaching a billing representative to resolve their issue.",
        "type": "Customer Service Avoidance",
        "date": "July 28, 2023"
    },
    {
        "id": 37,
        "source": "x.com",
        "url": "https://x.com/christinmassey/status/1838688721010376731",
        "header": "SiriusXM cancellation process creates unnecessary hurdles.",
        "description": "When attempting to cancel their subscription, the user was repeatedly shown promotional offers and forced to navigate multiple confusing steps, including mandatory chats with representatives. The cancellation process was deliberately convoluted, making it difficult to proceed without frustration.",
        "case": "Complicated cancellation process with repeated barriers.",
        "explanation": "This aligns with the 'Roach Motel' dark pattern. The system makes it extremely easy to subscribe but unnecessarily difficult to cancel, using promotions, unclear navigation, and mandatory chat sessions to discourage users from completing the cancellation.",
        "type": "Roach Motel",
        "date": "March 25, 2024"
    },
    {
        "id": 38,
        "source": "x.com",
        "url": "https://x.com/hamburger317/status/1862888215084241348",
        "header": "If you ever think you're sensitive, at least you didn't fold like this chatbot did when I criticized it.",
        "description": "When the user provided negative feedback about handling and order processing, the chatbot responded with an error message instead of acknowledging or addressing the feedback. This prevented the user from sharing their concerns effectively.",
        "case": "Chatbot avoids processing negative feedback.",
        "explanation": "This aligns with the 'Customer Service Avoidance' dark pattern. The chatbot intentionally or systematically fails to handle negative feedback, preventing the user from voicing valid concerns or receiving resolution.",
        "type": "Customer Service Avoidance",
        "date": "April 15, 2024"
    },
    {
        "id": 39,
        "source": "x.com",
        "url": "https://x.com/wojtekszkutnik/status/1736372389653430358",
        "header": "Adobe's chat system repeatedly fails to allow cancellation.",
        "description": "The user attempted to cancel their corporate Adobe Creative Cloud and Acrobat Pro licenses via chat. Despite repeatedly requesting to connect with a real agent and specifying the intent to cancel, the chatbot kept looping back to the same options and failing to address the request.",
        "case": "Endless loop in chatbot during cancellation request.",
        "explanation": "This aligns with the 'Roach Motel' dark pattern. The cancellation process is intentionally obstructed by repetitive chatbot loops, preventing users from easily reaching a resolution and creating unnecessary friction.",
        "type": "Roach Motel",
        "date": "December 22, 2023"
      },
      {
        "id": 40,
        "source": "x.com",
        "url": "https://x.com/justin_schueler/status/1629960530206097411",
        "header": "The Economist makes canceling a subscription unnecessarily difficult.",
        "description": "The user attempted to cancel their trial subscription with The Economist. Instead of an easy cancellation process, they were forced to interact with a customer support agent who asked unrelated conversational questions like 'How has your day been so far?' instead of proceeding with the cancellation.",
        "case": "Cancellation requires unnecessary interaction with customer support.",
        "explanation": "This aligns with the 'Roach Motel' and 'Customer Service Avoidance' dark patterns. The cancellation process is intentionally obstructed by requiring unnecessary conversations and prolonging the process, discouraging the user from completing the cancellation.",
        "type": ["Roach Motel", "Customer Service Avoidance"],
        "date": "February 26, 2023"
    },
    {
        "id": 41,
        "source": "x.com",
        "url": "https://x.com/Mars53208096/status/1861750340904800628",
        "header": "ChatGPT's subscription feature appears to reduce functionality after expiration.",
        "description": "A user reported that after their ChatGPT subscription ended, the app's functionality significantly degraded. It failed to recognize image inputs and seemed to have lost its context-awareness, causing frustration and confusion.",
        "case": "Reduced functionality after subscription expiration.",
        "explanation": "This aligns with the 'Forced Continuity' dark pattern. The user is led to believe that unsubscribing or allowing their subscription to lapse will result in losing essential functionalities, pressuring them to resubscribe.",
        "type": ["Forced Continuity"],
        "date": "April 25, 2024"
    },
    {
        "id": 42,
        "source": "x.com",
        "url": "https://x.com/levelsio/status/1853108595627540666",
        "header": "CannyHQ makes it nearly impossible to cancel a subscription.",
        "description": "To downgrade or cancel a subscription, CannyHQ forces users to go through their support system. However, their support is an AI chatbot that doesn't provide an option to cancel or downgrade, creating a catch-22 situation.",
        "case": "Subscription Cancellation Obstacle.",
        "explanation": "This aligns with the 'Roach Motel' and 'Customer Service Avoidance' dark patterns. The platform makes it easy to subscribe but extremely difficult to cancel, requiring users to contact support, which in turn is obstructed by an unhelpful chatbot.",
        "type": ["Roach Motel", "Customer Service Avoidance"],
        "date": "April 30, 2024"
    },
    {
        "id": 43,
        "source": "x.com",
        "url": "https://x.com/perryhewitt/status/1188434469293875201",
        "header": "Verizon Fios chatbot makes cancellation difficult.",
        "description": "When interacting with Verizon Fios' chatbot, users are presented with options for renewing, starting, or restoring a service. The 'Cancel service' option is visually de-emphasized and placed in an unintuitive spot, making it harder to select.",
        "case": "Obscured cancellation option.",
        "explanation": "This follows the 'Roach Motel' dark pattern. While subscribing or renewing services is made straightforward, canceling a service is intentionally made less visible and more challenging to execute.",
        "type": ["Roach Motel"],
        "date": "October 27, 2019"
    },
    {
        "id": 44,
        "source": "x.com",
        "url": "https://x.com/DD_Moran/status/1796957930069037324",
        "header": "Twitter bot fails to provide actionable options for subscription cancellation.",
        "description": "The user attempts to cancel their premium subscription via Twitter's chatbot. Despite multiple prompts, the chatbot repeatedly asks the user to select from subscription options but fails to provide actionable response buttons directly in the chat interface.",
        "case": "Non-functional chatbot interface for cancellation.",
        "explanation": "This aligns with the 'Roach Motel' dark pattern. The chatbot creates unnecessary friction in the cancellation process by repeatedly showing non-actionable text prompts instead of functional options, making cancellation difficult.",
        "type": "Roach Motel",
        "date": "June 3, 2024"
    }
]